#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_pet.secret_name: Refreshing state... [id=absolutely-helped-monkfish]
random_password.master: Refreshing state... [id=none]
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0a28d56b4354e1555]
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
aws_db_parameter_group.default: Refreshing state... [id=rds-pg]
aws_secretsmanager_secret.password: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond]
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.ingestion.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-ingestion]
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.ingestion.aws_s3_bucket.ingestion_source_storage: Refreshing state... [id=levio-demo-fev-storage]
data.aws_availability_zones.available: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.ingestion.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-ingestion]
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
data.aws_secretsmanager_secret.password: Reading...
aws_secretsmanager_secret_version.password: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond|3682813B-FD26-444E-9A4A-059E260A3BB7]
data.aws_availability_zones.available: Read complete after 1s [id=us-west-2]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1909623485]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-logs]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-ingestion-20240111144058395400000001]
data.aws_secretsmanager_secret.password: Read complete after 1s [id=arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond]
data.aws_secretsmanager_secret_version.password: Reading...
data.aws_secretsmanager_secret_version.password: Read complete after 0s [id=arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond|AWSCURRENT]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-06f715bf935e801cd]
module.vpc.aws_route_table.database[0]: Refreshing state... [id=rtb-0aa60a64fc5b1a696]
module.vpc.aws_route_table.database[1]: Refreshing state... [id=rtb-0021f9c618a3119d0]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-035759611c538ce80]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0559b61f5a74fcac2]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0cea1fda906409973]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0bbf6497c54be8733]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-027947bcf325829ac]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-02d7c67035e5124fa]
aws_security_group.database_sg: Refreshing state... [id=sg-07425be98e514225f]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0634c8e7fd10a8009]
aws_security_group.lambda_ingestion_sg: Refreshing state... [id=sg-056eb17c17ad555ff]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-034fb73568e35a2ad]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-05a85d90c903644d5]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0b0356ee59303c51f]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=ex-terraform]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-027947bcf325829ac1080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0fb53b1aed3271b31]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bcce440882e2dc3f]
aws_security_group_rule.db_egress_all: Refreshing state... [id=sgrule-442621240]
aws_security_group.sm_sg: Refreshing state... [id=sg-0d150a18aaa621a04]
aws_security_group.bedrock_sg: Refreshing state... [id=sg-073098b78e8aa32b6]
aws_vpc_endpoint.secrets_manager_endpoint: Refreshing state... [id=vpce-022eb3a6d85fa06a7]
aws_vpc_endpoint.bedrock_endpoint: Refreshing state... [id=vpce-0327b452f427d62fc]
aws_db_instance.vector_db: Refreshing state... [id=db-YISND6N7BEMRMBM6WIYBKS3WJA]
module.ingestion.data.aws_iam_policy_document.lambda_policy_doc: Reading...
module.ingestion.data.aws_iam_policy_document.lambda_policy_doc: Read complete after 0s [id=1057032996]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ingestion.aws_iam_policy.lambda_iam_policy will be created
  + resource "aws_iam_policy" "lambda_iam_policy" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "lambda_embedding_inference_pgvector_policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                      + Sid      = "AllowCreatingLogGroups"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:log-group:/aws/levio-demo-fev-ingestion/*:*"
                      + Sid      = "AllowWritingLogs"
                    },
                  + {
                      + Action   = "bedrock:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowBedrockUsage"
                    },
                  + {
                      + Action   = [
                          + "rds-db:rollback-transaction",
                          + "rds-db:execute-statement",
                          + "rds-db:connect",
                          + "rds-db:commit-transaction",
                          + "rds-db:beginTransaction",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:rds:us-west-2:446872271111:db:vector_db"
                      + Sid      = "AllowRDSConnectReadWrite"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:CreateNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowAccessNetworkInterface"
                    },
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "dev"
          + "Project"     = "levio-aws-demo-fev"
          + "Terraform"   = "true"
        }
    }

  # module.ingestion.aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "levio-demo-fev-ingestion_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev"
          + "Project"     = "levio-aws-demo-fev"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.ingestion.aws_iam_role_policy_attachment.lambda_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "lambda_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "levio-demo-fev-ingestion_role"
    }

  # module.ingestion.module.lambda_function_container_image.aws_iam_policy.logs[0] must be replaced
-/+ resource "aws_iam_policy" "logs" {
      ~ arn         = "arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-logs" -> (known after apply)
      ~ id          = "arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-logs" -> (known after apply)
      ~ name        = "levio-demo-fev-ingestion-logs" -> "levio-demo-fev-ingestion_role-logs" # forces replacement
      + name_prefix = (known after apply)
      ~ policy_id   = "ANPAWQC5JXED5L6D3R3JK" -> (known after apply)
      - tags        = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.ingestion.module.lambda_function_container_image.aws_iam_role.lambda[0] must be replaced
-/+ resource "aws_iam_role" "lambda" {
      ~ arn                   = "arn:aws:iam::446872271111:role/levio-demo-fev-ingestion" -> (known after apply)
      ~ create_date           = "2024-01-11T14:40:57Z" -> (known after apply)
      ~ id                    = "levio-demo-fev-ingestion" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-logs",
        ] -> (known after apply)
      ~ name                  = "levio-demo-fev-ingestion" -> "levio-demo-fev-ingestion_role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ unique_id             = "AROAWQC5JXEDXQTYCEXVW" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "logs" {
      ~ id         = "levio-demo-fev-ingestion-20240111144058395400000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-logs" # forces replacement -> (known after apply) # forces replacement
      ~ role       = "levio-demo-fev-ingestion" -> "levio-demo-fev-ingestion_role" # forces replacement
    }

  # module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "levio-demo-fev-ingestion"
      + id                             = (known after apply)
      + image_uri                      = "446872271111.dkr.ecr.us-west-2.amazonaws.com/ingestion-lambda-ecr:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "dev"
          + "Project"     = "levio-aws-demo-fev"
          + "Terraform"   = "true"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "PGVECTOR_COLLECTION_NAME"      = "emails-embeddings"
              + "PGVECTOR_DATABASE"             = "vector_db"
              + "PGVECTOR_DRIVER"               = "psycopg2"
              + "PGVECTOR_HOST"                 = "vector-db.cyxgx8pmxirg.us-west-2.rds.amazonaws.com"
              + "PGVECTOR_PASSWORD_SECRET_NAME" = "arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond"
              + "PGVECTOR_PORT"                 = "5432"
              + "PGVECTOR_USER"                 = "postgres_admin"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + timeouts {}

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-034fb73568e35a2ad",
            ]
          + subnet_ids                  = [
              + "subnet-0bbf6497c54be8733",
              + "subnet-0cea1fda906409973",
            ]
          + vpc_id                      = (known after apply)
        }
    }

Plan: 7 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @FloRul, Action: `pull_request`, Workflow: `Infrastructure planning and management`*